package com.example.ossan;


import android.app.Activity;
import android.content.Context;
import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.navigation.Navigation;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.TextView;


import com.google.android.material.bottomnavigation.BottomNavigationView;
import com.youth.banner.Banner;
import com.youth.banner.BannerConfig;
import com.youth.banner.listener.OnBannerListener;

import java.util.ArrayList;
import java.util.List;

public class HomepageFragment extends Fragment implements OnBannerListener {
    private Activity activity;
    private BottomNavigationView bottomNavigationView;

    @Override
    public void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        activity = getActivity();
    }
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState) {
        activity.setTitle(R.string.homepage_name);


        return inflater.inflate(R.layout.fragment_homepage, container, false);

    }

    @Override
    public void onViewCreated(@NonNull View view, @Nullable Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);
        RecyclerView rvOssans = view.findViewById(R.id.fragment_homepage_recyclerView);
        rvOssans.setLayoutManager(new GridLayoutManager(getActivity(),2));
        List<Ossans> ossans = getOssansList();
        rvOssans.setAdapter(new OssansAdapter(getActivity(), ossans));
        // GONE是隱藏 VISIBLE是顯現
        bottomNavigationView = getActivity().findViewById(R.id.navigation);
        bottomNavigationView.setVisibility(View.VISIBLE);

    //---------------------------------------------------------------------------
        List<Integer> images = new ArrayList<>();
        images.add(R.drawable.slide_2);
        images.add(R.drawable.slide_3);
        images.add(R.drawable.slide_4);

        Banner banner = view.findViewById(R.id.fragment_homepage_banner);
        //設定Banner有圓點點
        banner.setBannerStyle(BannerConfig.CIRCLE_INDICATOR);
        //把想要呈現的圖片設定到banner
        banner.setImages(images)
                //加載器
                .setImageLoader(new GlideImageLoader())
                //設定點擊事件
                .setOnBannerListener(this)
                //設定自動輪播
                .isAutoPlay(true)
                //設定指示器的位置
                .setIndicatorGravity(BannerConfig.CENTER)
                //設定每張圖片要呈現的時間
                .setDelayTime(3000)
                .start();

    }

    @Override
    public void OnBannerClick(int position) {

    }

//------------------------------------------------------------------------------
    private class OssansAdapter extends RecyclerView.Adapter<OssansAdapter.MyViewHolder> {
        Context context;
        List<Ossans> ossansList;

        OssansAdapter(Context context, List<Ossans> ossansList) {
            this.context = context;
            this.ossansList = ossansList;
        }

        @Override
        public int getItemCount() {
            return ossansList.size();
        }

        private class MyViewHolder extends RecyclerView.ViewHolder {
            ImageView imgview;
            TextView tv_name;
            TextView tv_quote;
            TextView tv_price;

            MyViewHolder(View itemView) {
                super(itemView);
                imgview = itemView.findViewById(R.id.imgView);
                tv_name = itemView.findViewById(R.id.tv_ossanname);
                tv_quote = itemView.findViewById(R.id.tv_ossanquote);
                tv_price = itemView.findViewById(R.id.tv_ossanprice);
            }
        }

        @NonNull
        @Override
        public MyViewHolder onCreateViewHolder(@NonNull ViewGroup parent, int viewType) {
            View itemView = LayoutInflater.from(context)
                    .inflate(R.layout.item_view_ossans, parent, false);
            return new MyViewHolder(itemView);
        }

        @Override
        public void onBindViewHolder(@NonNull MyViewHolder holder, int position) {
            final Ossans ossans = ossansList.get(position);
            holder.imgview.setImageResource(ossans.getImageId());
            holder.tv_name.setText(ossans.getName());
            holder.tv_quote.setText(ossans.getQuote());
            holder.tv_price.setText(ossans.getPrice());
            // 點擊一筆資料會切換到下一頁
            holder.itemView.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {
                    Bundle bundle = new Bundle();
                    bundle.putSerializable("ossans", ossans);
                    Navigation.findNavController(v)
                            .navigate(R.id.action_homepageFragment_to_singleFragment, bundle);
                }
            });
        }
    }


    // 建立測試用資料
    private List<Ossans> getOssansList() {
        List<Ossans> ossans = new ArrayList<>();
        ossans.add(new Ossans(R.drawable.uncle_image_1, "馬東石","人是善良的，群眾卻是殘酷的。","$ 300 NT/HR","自我介紹\n" +
                "\uFEFF學畫此所所舉的友電因其真事我日的可！想從定住黑件設語加不力定，全時數來記車育的，的來水商子不管禮紀職上；什片次，年時子她業獲少來任年。施毒的遠燈讀我要是後可海們此！理人到結發政處眼過了下業如施有例去一一生利管能無專報許信放古土了地點？技交時電家石人和不要；便舉明現器整她我倒經越社麼！開上叫一，我又制生日，時業高教去和子接，北東好式一之候路客角制草民製環兒難過積建球了太規字遠，大師不大散面去引英司也快生軍生我魚：報重組子？中整作響預關才排中一物時爸新，也新我到應智路水國知大信就物的一元開連可重是片切麼多步情書當注晚公，種音的地者是品格有價子大服呢廣專感安人：高展只土：刻收人果語只原時老可又但文主，星沒出喜實；能景道坡……走樣老國想；之新陽源麼；那到請程當有故歡，以也人目原實生人非。說往經不東出角斷你是座一各自兒類銀色？重陸門關住方曾也戰時乎種你可看裡沒不模而的地、高腦真風開這位國之有南是有極巴玩的是運外直大，不業品無製帶你機是老在們過滿心技理去不怎而議色二護著國童出著人！幾臺前也樹積一部、漸亮師下？感坐人不服，大眼問……裡我見。\n" +
                "\n" +
                "無生的，還一天知表雄色斷童不火何的五導是通跑個領力輕新了入進日是土年受日料，來十始？細水國了開兩問？電面等義表過國會羅冷代：爸值聽德會見形別都會美非事量格馬大視注叫望看數成孩大行客公送南，點因遠？也樂學！電事來精的藥我說旅，人不洋合路眾他日，草長及望：他有告已國年了模兒包那理也反辦以是到，自臺正重裡，長才講是工沒有……參該險，人例速月才風理義點也質球中氣甚笑之為便化怎，灣意由，入面及成燈體是。從合評待人現場：會心心世濟……像兒響年發充我真。政有計家，大的論人每究內總會有識、細日背……孩小經活已件！內心定將禮部單要這可……下導個，城因死程好元投正傷四強險月嚴氣、百經目，明動夠走示雨表長們，山前怎兒對推清認寫起有創場口立準級對層解難標回斯形香生此不山地消如教親讓？管位人動住著他她自？在立白往，何冷然人銷處當，地急步斷者這個看進裡色常國的聞簡量我小日母眼政標好能。\n" +
                "\n" +
                "來電還面，難就手這名，白來件來也人人政愛處以三。作一時即布接景哥異我型河統投往想國不市示排。不人條為是民里開國。良有觀南雲，治花裝，著就用費到間正著，提可一而常減。\n" +
                "\n" +
                "像府展線世，族里任比本作個：全什體速次明爸空上就有八表……很裡後再是其家視他日策少跟，讀操西院推家說財。園叫馬與然落話事平成北們達們為不景子而公種意動親：著座是似立土點化學，出父不過你常在任製怎有麼一容這年還推子年選單念，水前形神畫口因種產能族的在都葉下在。極麼的增再許完招多雖大突怎火會計得心香商化……故人麼費大天水，本我亮要企紙容自保名何文化微位！可是失麼！交給是道一現醫毒全們、如三不議他就出將是竟飛走請應石，待的長醫理心面者神議死廣我稱由不中家聯又血！"));




        ossans.add(new Ossans(R.drawable.uncle_image_2, "小林熏","所謂成熟 就是明明該哭該鬧 卻不言不語地微笑。","$ 300 NT/HR","自我介紹\n" +
                "讀長習當通師運以多他出和了我力。我量元力家燈票病了問不比？受回是的。\n" +
                "\n" +
                "的媽產我人地文定；高多到我獎不地獲明會產來不果面，送少來不們藥產育我在們會，會由來，好精我聲頭因檢。\n" +
                "\n" +
                "旅本的無的笑明，雲了兒車；久會廣。就一孩生期係；行真聽人日愛語市曾只聽獲營藥少一，半美火木我生人者深回不只色子道感說期不城間文選？知帶力產出變心制球活高功超？通受論！放再一？受行問都雙加實是你的點期保路工工假顯是一。急車深，母設化的一就會廣女即深差才情盡望家制使果靜不車，不行說人能命還會子代不臺樓白文中清一內關不本？性命社。\n" +
                "\n" +
                "林重民次，也來這狀，賣是和官花，政角那入去的整自計正陽的起成太！出前來這明停不底半生，方證在外新意算廠共價計你委不歷力……持創未腳出錢意精不半等當了熱土一一車深觀不價色列，節一以至與物的電團血相正市切主受卻停開許媽外照光務公營。只放去在自的母來讓在關男他金分語的以音很空以無少港雄文演乎，步我結不經樣必，我事如得……一度一好會眾腦力，才有！\n" +
                "\n" +
                "是常國是朋力過不常兩好底舉定、色發足不太拉個陽樣連軍不她國家：們管必到出我裡構要流活增效活方得種了元吃據年？好下上子歡的沒管真提許氣這學級，需綠基不建有？需生的綠男不便那市我人裡進做加臺和從制把與電，所上去一……我酒打場亮意聯好說團面見於，生方飛畫此願資當。技沒頭天改分漸有是術求子突，期小的考房們車的由的開是帶，學保生設商動在的家動讀很心，家看是定？說西方著義感心了龍點開有們不非起的然權沒謝要自不年發山，半列力難是求致，個統家一生間實弟品中操民！分究色地落王體這真；有中病是息心類作動管發：記功燈，起果模在著原、賽到成用意國能孩們本就那成人化之自觀動車對或如率班，始所上天目？\n" +
                "\n" +
                "回成朋這計文空特身然天有但。領傳立我天形靜陽由金人接可舞些果經縣加小行，數方長全能仍！\n" +
                "\n" +
                "河升選卻果念入用本裡低比影程告此。步有又門當自；是成不倒分，太子來們學遠林果去品是同子年，務臉會經、起劇緊作原理識識？事求公沒麼成特被，化的位能場。\n" +
                "\n" +
                "國年裡水笑友術。\n" +
                "\n" +
                "小的陽內應不家。要起小、據下子字為希小回苦，人得長外德玩林示復大人科拿理可！血海要機東有美義基鄉法味過燈實！\n" +
                "\n" +
                "實白高打人；子加像多高提們語……什雜小現百重品曾以方：出直吃生合劇只，舉去吃？下雖日知起條，前不間球會是品分，不生案了名想人指格聽天車白出多至現己公分來病。廣印布演己間似在能為且不望怎內銷在多業行校人還不用之山童息你具任全主如其後非老黑的我爸只斷有現然系政媽評車角定信品有行的各教教以發室相藝風愛，在建足。看燈汽全好由清子策的單這服親元感就縣是生幾男區小而不具親語然非你到定明了部可，行行從在金著陸會象張交來健年一檢？壓個去就的，中兒男童過自正資我金生不心了運的新一者石色服！\n" +
                "\n" +
                "特兒子樂當。"));




        ossans.add(new Ossans(R.drawable.uncle_image_3, "北野武","雖然辛苦我還是會選擇那種滾燙的人生。","$ 300 NT/HR","自我介紹\n" +
                "\uFEFF上所視深件然的社越動朋苦上信和文了室讓回滿格化為上美因境，電中開好產，可能活們我畫古地不、日場紀……準話小戰集一回親上、金海體可，怕香合：及不於友送施興當時片訴，何是常外選！的一物拉看的高！說傳己境兒局……是一量天心、古器文好推。社傳開自因果過年排不……還國我是消。\n" +
                "\n" +
                "主上人行我政河進一有上畫府廣為期要建光方有色……我上地地他經使印比當稱接接、家然非可進女，子是品升麼動，響下工讓頭下解合元能，化希成把能少成，無大覺會處不長通童問人少身性安。報動東樣、研岸都四一個有參全接每第。\n" +
                "\n" +
                "紅引頭動家從；拉臺課正的有合，留用能體作那站出問說一密之學提上往在受林輕談上沒飛白地們交，想在可以中們不回學了，表北要出痛陸知跟取問住聞術。也減所子動生車，面媽數特是是配，盡有參有總回，學體投告不？藥在然器放得線本長幾究經失或節也見市進的評院還西過數就在子，息每了來實性以媽真下：士個那館年過人接品？根一後電居金富，指地足工先發一地那府野發響。嚴本待我國收讓；力人回司然只年起便就這入大市員做一喜快點。\n" +
                "\n" +
                "社臺情……經下海也藥年聲，整指場事輕空壓麼適女們有費，十看但那下裡跑工們排後如過重斯不，病發取家行轉之快年一樓，際未候美好所自機建，傳臺斯紙裡不強能那，問書見可，關所選吃那親例機面上讓了票取致一了院產大又線年修然備度沒物大變樣。基多花……提英子，給想音藝出裡。比的景線有學院研們食……詩計參高故下結。\n" +
                "\n" +
                "裡時去業深生情準該但得的人類！算結操安的北！身小縣都那生策大而政他男石史生的會聲我一不有可再的已得起動倒成服只是當車的供，何自我聽，有笑提而口財高樹熱花才所出民是說月樹北此難龍中出沒奇氣。\n" +
                "\n" +
                "城文盡先能地住信製次依成家辦營現意裡樂走試條人地然必的小有。的巴歡風真。車性時著持靈員自題錯開很灣市相布開此家在別非甚發那具先中與八委！\n" +
                "\n" +
                "而度於容河星是者節卻可入父助想利器，有親倒重合。車叫生去學聞收呢樹我小十紙，的實禮年：本到想：同的人東文雄開意每事許布有立指不使結部學子中這從性爸天母氣手間個樓生你用參近；保園選時面人校客聞象我的作錯分外，們下它出士害據助而間人名局起，任子字得位筆、不度拉物慢女在鄉代關可令；臺法腳檢為聽發，了起議好並。那年使場至。證而再旅資人。龍沒合師吃當天馬說，基地品根效。究資員：黨三保平政，領海英水道要、加說養廣於讀變，開下的！大世對八的提絕地都地地裡上……黑紀慢頭進地獲三考二麼，現實向主了起：要阿國怎不陽球工命消童，不營己；原質算立北！神然有一此什？在感市中每器人早細色：小出的！西包改都灣雜香校手坡過了觀良中，有新親點紀雙教四個童主正此其識管已？力速表出書也媽輪們位就，調有市原的基作北海前的？\n" +
                "\n" +
                "一長電東了管然時完表、沒美具本；老國臺：我視時入。了出票低選一慢運引綠在連買安濟當的來美他。形心裡藥上無表不起，路明的票營，出出最至計廣服他發式就高外於。時盡日表題問藥不家我要和清一起才了道相。"));




        ossans.add(new Ossans(R.drawable.uncle_image_4, "老查","與其100%的人喜歡程度10%，不如讓10%的人100%程度喜歡。","$ 300 NT/HR","自我介紹\n" +
                "源式間心到岸因什民響的息走地代生速中無用事機後線越言生哥一藥率賽。各以叫沒一點春西聽學面個水政唱國較月康濟告同，飛樣告。\n" +
                "\n" +
                "推友排電定：我至見爭是臉，筆選呢化其是，讓的己、兩叫會？臺論問為民命在對教因？後色卻害化……究他開希、舉費政發個，痛四城長由鄉室今不了見要分種指！\n" +
                "\n" +
                "車喜了十。公紙行。民來爭五也是看我，令程治答保道圖教兒後個反者因化位他管放先理水進了怕，球向有策個育就列分願，花作了已的。\n" +
                "\n" +
                "怎該上動家是電受活，歷山錯看死美，別上府裝天民不學心但完會友照時城服生空設、音作度而！\n" +
                "\n" +
                "的平我只念受家十，中體情才文是法。基認只管如你朋要印場真海體家力事道平任愛防然他房麼以魚日中青不年道了，戰樓為？\n" +
                "\n" +
                "向不性因出走上。角開地不臉持我營下……城力不們政：司為地業所陽智優學愛量北價這常中精就行是務工、答她路型聽品病海各……生在願發，古這得濟天以落，同傳收容其個東長保藝；望房千著同：無股往。如養皮起大無水思力的長大出拉發都次則、這前高少活把國，因照人作人。學些善多吃代白兒人許要正來件事。好故務天說持容心決論近他日多一年減近，此多爸我一開？委動常的意大不，理招園好心該高開人高然學考相時觀找又英院此案沒能山黨底車條臺現視當部是到我是命特車，上相落的文，大現北入給念念這？發務合一時呢代調汽來。經銷導有康為運！也不女利高哥一感河整留，小洋行同發，體情車傷。\n" +
                "\n" +
                "小然樂高益夠家題上星參委前下房內子神？球電比推型美話富不計生樂們開子願去我長校身快這後何寫出性，好可國是故雜口格及可親每一黨人張二風回得開到三種麼中正出！林者相演門學友原考張位形好比長、作學生給葉外可早代。看唱子聯得教自優生，小不工；業的色春參我天能何，最水能較驚故人，重事如廣，有目場境熱不規件想上來，紅夫覺告員景是的：西化明服十廣中靜！回後家備時訴可寫不上阿媽平神大……行乎看地來天，局子養低提極？叫其新河。急臺麼解白，頭天常制做雖出興出合保著不、文利人是三終地：主媽歷的的世，山每遠銀小始始界且山可頭，組與法自是然以從就新說書色室相果趣三龍人產觀國天每位花非，來長員心起座能一電非車雜人研親時元時其？什到向發紅接是因應媽王開。\n" +
                "\n" +
                "人性讓開社考合氣得：青字聲。物了件火事道觀非美一生滿待推！者重子中同在子全上舉時此園關得他問權！一件臺！本新且早用有改字回他驗一、雖路根空十長想以下亞好中頭一法的藥著童無綠畫論自且是共該實年不？房不善那自，基統陽和論它市中義開人一創富本到票試各入於圖斷不出畫般的了懷戰個長小。他樂日育上身當次，要化社界自：心色機一樣小活主方個依！會幾界看死事他帶府道先、必帶及市，通已竟官，形如示金：望能一情兩物深法人市已定無論風：當地美麼照坡，是家情本，照出法錢立子書，後麼初建做過時子詩南長門完只們買熱本！我演多如增？笑來習的亞高東庭為分真地位兒動自期廣兒訴再定用民而此的然許時並客。"));




        ossans.add(new Ossans(R.drawable.uncle_image_5, "陳道明","做人的最高境界是—節制。","$ 300 NT/HR","自我介紹\n" +
                "該方少深對了上政門運來示爾間比意區燈起質重力景停識沒期應場多力己養格說專主同家功特其洲；多東分天看，大你舉人發們師……口是大倒投德對史處真大維演飯廣相濟隊過我人，根其格定不研分英見性認事小產能心式收想同表不視點的是元。年有花我辦建到較數長會動：卻先裡毒機美親幾紅注各和每、感子味準之護原的回西境然，通件投工興兩華；風我麼文管！農見北：己藥要意電更斷以，紀她會發孩中朋林府光有臺美……得心境不開寫現賣經與所造聯的險能對防定前親約不國阿黨；子天力現做父大子子上全生機他麗臺何組人臺用需！同國麼境，近高同而氣如子流照在四開、龍紅新認車。本王上業長好有了運的心，才我頭斷了。\n" +
                "\n" +
                "願時相去許一臺次國備車家，顧離是客自上究是轉著機醫重身部夜個其裡所人，生叫機務們作華語動體意算車灣量傳方許手都報進來。富變式中話再，如展。\n" +
                "\n" +
                "是童遠在小觀學有於有高自。高起經女之魚看；聽是時重位形人外來、開手氣國保總個的這環全象氣世選沒學度在很步，升太我再在相叫。候老甚教言望年展明痛，國上劇很高心財談。體簡境還火定照後色飯人每使體有！\n" +
                "\n" +
                "軍來早……麼國同象的作，唱在不超紙度麼究！火後值裡大作以相顯？就速開和腳檢文、智的上的懷海門引人每響細獨的在他教角輕都靜不的同合智？起是蘭方民麼北；失有就：願政行。才保太在充級我開年民現品情唱母嗎立市用異從到常足即有，輪議機而得談樣醫的期修方管上寶。排士又留多來不每然草，學外人定路該省根飛系因日何，理變的員。業車都下到人角原必目境感……現界感國遊頭條健效求立個臺國可改值物不學，少他次算相，奇是濟沒來女雙原似和門專強大者把信年山個來民子度樣得大大我目法條。\n" +
                "\n" +
                "怎公就爭兒；造用叫花打定共一線春時結條輪覺散頭顧銀候人期我香族見的他克園假想活也河研人立春候全影……產保是代難、天色可再讓不經。時希願得的好金一推蘭道安能地區而聽為……自生日由然保言的少學因因辦果方響一開市能政會個投年頭統希？以南理。形深院。目土有推師他再會房許得……來小連香過的；創育生、小過低極強？於是行團視非客計中地為，在金設加家政？南一易強助要背果轉？\n" +
                "\n" +
                "國路心並經於雖洋像園，子統水打，優為生師山理當有弟，和道又，來老子先！線頭少心府家而結得照面。於車吃心太大由意那達引地定法色來得康使究是過子飯都動寶清新。光驗感已家！油題國可交未術來！大象要北人……過程風石史後史器在，德對李、動整復神有經流落義山林集到我每詩小知花能位，算中蘭臺可己念形……十分上們兩治弟求、各黨使資質，光兒反指我門原日。完過葉香可高親向形其與性而海賽開利千八活期改字現球小字親日臺是，為金不影感醫病待一變想。國聲子苦進學智可民一麼動友化回顧片各，何高港記，水代特地和背務不所水。建得民不家使老？已書最候！何情天你門果市、料這死分方想足備？家多年地要一庭因是在片轉時的。"));




        ossans.add(new Ossans(R.drawable.uncle_image_6, "葛優","你要想找一個帥哥就別來了，你要想找一個錢包就別見了。","$ 300 NT/HR","自我介紹\n" +
                "費有羅出其出開據兒長再，了外地的，位連當中英：而化我公場車心德房世，今生學。成們只牛的千寶選身東；山社車時立重四確代過女畫解地著開一溫每，全書投。\n" +
                "\n" +
                "考們金此體絕大法他著，城最話成，約情飯是世起足易麼者始！檢走中？有果給服傷進產通德別是華可法安黃目只得康樂原保希，邊海學以速做一導三令工國著小名了天。期在義排、在生一得山們有中為色萬那老持國不斷業之不後查的小口解，地切定。鄉所自取林，方參何？出在過不之國、當源情職車有種開日導新然始用沒阿？方能不長好皮小好起一？華管我屋切死一不起比，以好已代氣久不高……樣麼的。實們是意法辦冷：該響信時立農立字識我可，照北這最工可況風華新利電著，到小那夫求心設力場人是財觀約全下得、不萬行設家今日分素題回手自：大他生故，事子企部變方驚國海現回好紙處家持馬，運到果門辦多問包長視或！大起之位室，孩成廣！不客護的你年念別了成收參：員像式人質客排照表去細處看來球點快圖但外庭試，時回沒笑來的求內了境，時布場不已表放陽好很以持子城形了我全你紙信東們光？港禮道問員們正想集、環式實人難片爸需了隊利費花自度念不近生頭或方會一未？算紅小同看論參度道不基作有我了同陸通麼們，提社務外就類子覺有是常中模的我辦的視加東取美過事笑要，落不合代西在人……族裡書之空平麗與空以山洲健過支說列縣麼我養運會個先口子線賣學來、態自名體人心、生和就起裡國一卻著術花有什非決清始倒們假課門水減他對生班地極、規字達，路為命他頭成，而作車字以有連一來又組其生旅火破期日星加那共代，間簡保，一多持難的他為。飛學約，聽回裡民布聲前來條第一友老神一創連，北頭了個優、日曾地旅會為裝。來年解感面師很；過北長訴要防動正來己有的已滿是樂境：去長會沒請語嚴。\n" +
                "\n" +
                "夫南很完；系看者年別……工象看大大車；相舞看入現大切自把價美還的不拉這！專智看易是理而了點出報馬樂全員不白用高員月表預他綠招是？車女回我，馬委方晚夫到球美點黨！單百老，這望定裡我，高縣去準而中的地。\n" +
                "\n" +
                "身為益下字合洋什、統的時那被學數房教長為路是，起財制整人畫權太來民發紅心千她及李醫商古人結圖童關照的走人一有，參近需動爸陽時公賣，張部示想人義從難情不要切。新媽那。\n" +
                "\n" +
                "細點報結。地方靜機我市人認身變有養示以易必布將原分期新，的衣務我見表衣。的不兒一國我教查響。環造沒兩……氣決新。包醫用童，現的麼說減得去於土料好就理印！在造了業麼曾起西名樂，德重和華情，委設能高身住非了三可靈職我中院開大口石語進、會的興經必如縣，離火並生總，確心都之看系為排景當更然計毛善夫待適際學低他燈……客要道即如在斷難。天而吸有年王當廣在其女越、不士起是不臺究？和一影成也也問不，華如說種通比月求：益意影場來，角立地立形以夜清留：養上位念親根議之們來在去弟能生業但爭。機事我不自傷許；對謝發力來環聯先機陽做親美，還題他決？\n" +
                "\n" +
                "招那火生臺之無風知頭品戰害似十。"));




        ossans.add(new Ossans(R.drawable.uncle_image_7, "柯文哲","你不解決問題，問題會解決你。","$ 300 NT/HR","自我介紹\n" +
                "次阿體門老時了食病比心白地是說法世然不非，年業不像，洲頭許……應開麗五沒點千養中且不低起決多是同的是文我那兒例不來運日始臺客靈於不旅成小些嚴到起；業在年研背十導就平合，水光計和沒了影叫去第來費上落像成收入大行光可品：在種示道你下社情人法世辦許雲前官基紀地代林過不合並我洲路立實色陽條！包這他冷，手考用第始前竟家上初業大點在得；我腦安王例有保那人居正師親親著年活還的供河克出，你商裡金然，綠死言差什科往不為當失行的條組樹是在金日景哥著府給是日股。\n" +
                "\n" +
                "行念問又沒觀說未住聲時！\n" +
                "\n" +
                "新農世這人員回童車又廣黃記只的子車結府。的創作大親覺術，資喜線況人八開點。負他受哥強經！真阿臺書說工照我資，選李地會心工此，通自不看院盡文場特向基呢，第美市少家不我出拉？\n" +
                "\n" +
                "場我真情，入人人活很有。住全重民鄉資現是自來易念來由！於當有才西手速帶下相服……歡長人個提愛，優有在，得如一兒話，四司型動會。上很有有、英又不日等和手真放外真們且飛現要時產狀一重活不關照只完否出要沒都景育四球有辦去個又不手跟變……和難告。有中他造科世做野次一無有進麼次收多近大代，這期區據；表愛正格個行臺。回見是寫黨濟對歡差眼學訴了是望最雙病一深復個頭以手，她各命存大作各的策人又演史！小了特？施照不得軍不顯心理給排愛情廠器許反著高委去點上時的。重校一容了了……系題我走老推初，及遊下原說入但都身好況有業下支；一基許：我客今的處系突大未屋係全廣……死保的何……山下可始班的。現廣保飛子第雜；火站光聽主便？成任傳，得老了他不行……局見一沒圖：分不得故族，從的什問點立投想學只之：一帶海，個習舉外；白記況層當電我：不大二。動就呢和落親無你生魚地看無下多它學故吃年資設定自沒都書，眼遊世如，麼以勢全面夫了金性害唱相，能的房不如後。山不美生一想市方爭有吸可去動。\n" +
                "\n" +
                "驚是他古來見，合有終在些的答醫黃，教事油。\n" +
                "\n" +
                "住館時……再隨著！\n" +
                "\n" +
                "飛國一裡死去說不國科習起切灣辦外青，話我熱解景，發術會如黃就取輕元史十本原驗童多是是活了燈，工小居得學的同不力你全研館研度件往品，用收者如，的在影早太大地排兒，奇的子去，的業行有市正同？\n" +
                "\n" +
                "獨力是道較其當，東能是業性廠大受裡統然友再，華中引記神場友。林物獲紀大但，用小說辦理……成術有水指有策……行以下考片有到銀原金害創真給的頭日。能不太，藝那大社已歡一成教本下。物面史車新無緊裡認化目十造來全在竟房本自可美不音水，不因只男？火主在充……現音讓校最一情試自量像團，治光如地打有不國以來好獲回不調到意性大來界我先？希地用！是空走花場他那今微生變外家，時年一教……行上一會漸會！面面到李我狀對打影生他民在白民會主林開！\n" +
                "\n" +
                "如問會到？表水速，像了我才。以說一有，較可和。生利價往民教！港運反可件，委到否家小當外：立原引素地什活傷感力是資本情示成能般感。本笑子會，男備好！對功年商來華團我人整是影，生為公設生來步聲，幾顯驗轉錯民。則廣行長由對非年西，斯是始有新切不這女我心案太建馬看打會告到！\n"));




        ossans.add(new Ossans(R.drawable.uncle_image_8, "李立群","人生如戲，不怕爛戲，就怕沒戲。","$ 300 NT/HR","自我介紹\n" +
                "查跑何地緊生原的報戰向念，質心品？方變。英眾感蘭關意上變差者原，對一月，的持情增府世子形了世義情登時子廣臺母立我可在，離微了改好電生外期下到國下正，引聲不較鄉海國就使：論我花生長外會的氣，過全上五的分雜為。飛站導持。多感小風好切所的言。同類進的師前士量開果牛計樂了家夫還學會德了，突美生去變把了自出相資。\n" +
                "\n" +
                "點著生今投謝製斷，兩史年，往男候毛灣話的談；三金他而新過加目李愛命求家，以響決海時住然銷味，此讀使相使是斷上的一不為女毛；智離的，上死轉生自市？海動立出。\n" +
                "\n" +
                "走紀道爸親孩然具的，歷品數收樣花期法我片那連失式。著預是十了教現……買長女孩相法此學界；大正我手定，原兒友頭未開海。修為新個作不善所龍已英事女照念。們特識各接當時線是界。當大形安縣馬。\n" +
                "\n" +
                "能的人案初辦爾有公雲立有樣我與樣水半時、他人童，成近境作石電長表參然該領與這思親似是房環意子如？方流所直景過。書待兒已是裡量一時灣……制展知過國氣知是天兒的過車子多密兒無於到投出效，運日王數法……們別唱師本助中，長為清……一讓一全的不子然發一標了又具中日友問果！上離看；人作老那第果五毛適意規總醫筆，方日星到人……花館小童常們命，病來山市：機館化間圖美？自名裡媽首愛山型讀回陽功是收；的水住動起：自包戰口源？情於我像吃黨國趣全大心我有苦；病害展！業級什實這目高火！法一樣病地一的細地應水知花子月談處體機此？\n" +
                "\n" +
                "過雲友決品現是育學。\n" +
                "\n" +
                "陽最們總級會長而出出的光？氣量是當理下支不此，天口在阿真樂牛夜爾一人孩要容要人政不！\n" +
                "\n" +
                "也八高死熱運形位病一都。的之多油良係遊是千指之學立食施輕水子登表位鄉？文大人。上只溫是，數斷引來已女鄉綠，我一族。\n" +
                "\n" +
                "到講叫期向條們然畫萬子管獎！轉安食裡；與德健是個到樣南喜品客花，感學只初那法，黨看最名是洲不年？性奇樹高樹遊水語方書中地我研。那位星民有請多醫上將形發人營實會指開因站力空的權住書心面香她義子洲來家本。的元又河小通底青主開見面，法書科片倒上一有出行提正教當依在做環食明中問理所看陽去帶不進更在真里快共情獲界望失的效能家招自這亮，向分音戰張有示快不無立體開求不法己信，機實共好在空於受西業自女停生本去毛油數度，代所巴業庭教一資花很酒多青思書角你花方太與們水所花的我水能大公線開時計家童把有空廣。公起遠而來中，中理音！傷正片校鄉，計好外未。病原馬期！分在我慢表……影他子企嗎當星會遠破經好活該利自生友公什族然期、業工人願也變老往家四張子之高那所有要之點明方並即入海人社聽卻電領間是，的的站那。有子少業全想年。展心看他陸是？裡由上是春，使愛感……管府不事生華飛？發樣積實傳是。\n" +
                "\n" +
                "續有能；期已上，是表再甚邊沒進足不越中得乎出行幾一母的不那念！河界。\n" +
                "\n" +
                "到童四費味有；計居候突作的上領不立濟藝一全影？簡由都的相次、著水立民同叫路技只究電葉法時大；風教們，名有了電麼信活會觀我白紅可要！留到文空之，我致備起了寫文將滿河合廣定生識你腦的？"));




        ossans.add(new Ossans(R.drawable.uncle_image_9, "甄子丹","所謂人器合一，心與意合，意與氣合，氣與力合。","$ 300 NT/HR","自我介紹\n" +
                "邊兒意裡的方人人我同作內低間企也：好身事問提最……生百方更道不文出增不信話答筆談；相小友：那經中子因綠做是業臺以同管明地覺度北位感正及像格少……亞他童先起、雙死人北香大發弟起提前賽邊語，子中的斷男視經重因黃公樂一自願頭招不賽許創片了能書四沒完些通公行而建進量發這考定立重現作否連了斯成童時們議室，平標為了了和人急程看的緊說有書多社！解白名生兩說易畫位取爭的……說想信之我用？年認如家廣她怎有其不母訴合答多理：廠是山目完道甚合，合期許天官所的馬，同像區會這靈商怎已引，興數有造語內自音；印這黨樹許收告單可們幾可前！結異我作方險看三無們管離像生。重頭事山手吸識市運生們實？權自用結！水留性寶住上黃中記經算，假們陽國他而目的算……過然當心無護因下推望天走識為意世酒同等體畫漸表……只生高……內開的點構真廣國神一福她法事；讀白不經個不局力道，例園投期，案手線精總辦程然精立金的岸之的中算國，車都這化失過再那風把和；小四大營於手大一模甚學幾臺而，子內字的，的數光馬的不我。\n" +
                "\n" +
                "數全馬時上制社從它歡化真也修……分不去北術員流不：相一當門問動我。候場存想出定他病育待算這品可現反！法也增教係先野事？術裡國年、小清友我人是算此……里人密中人元明新做老角許我反獲大他許一星和及內要等後極中人去懷大道。國定軍！民笑中義親國張小造奇等計地自風、識油玩離大準魚護有朋根積半球根現，高的觀他國重子來況子裝電真資長機規玩同量能的價親傳聲來應。王畫車的深！刻他轉社連間笑相了本發……類對是政，上醫醫算確飛確裡！\n" +
                "\n" +
                "大收人，才然道標少施民小景？管的度間簡小。物天世負便爸所好！望沒停細顧法大：研夠不，已在北，像要物在還你多：一麼小地省心樹聯式上星得到一構並研，有一部最關像機爸列。牛一他合故，為想並層其：通操有熱非笑過，多子我續花作成別物像然能建！理下很畫出、處一得吸、斯化像，深率度來陽來夠陸外至親行中在立在？\n" +
                "\n" +
                "言過特問麼卻經腦、不能了媽那要說出，背足表沒。未合新那器能但對的是至一有何醫隊過海企笑足點，後得球了，廣安地查了苦找便熱慢世，與早往坡：和場果關年，道求他設媽經業黨美己書女動。這當獎半府立樹來案車未這家華回發其，全我方相長；用花像地？科然十光什裝即所黨曾運包時望遠政加合種進比那數超日的學方告一……定經選時外死係府情動位主解安他個就死裡很學童天入不一子……時其通媽、出用與信國主難腦們果工是漸工個國、還醫阿父爾女業來味他具突像哥上時利人進山爾但會政上果先量女聲多：要的飯為就從現數改覺一雜冷本物片不願民作系回現之果下小回得；我面學處天代打高下快以，夫女早？下候假持什股黨張動。實可港或光品物經是廣車向要……學自讓小？始查而一作愛龍！\n" +
                "\n" +
                "要出人當多舞不們資單我沒裡基者已辦。\n" +
                "\n" +
                "球決舉人細藥名的不：河灣候可標時，飛少達，治快道血口是良地小應，甚我了建中不看養小高覺失頭說。"));




        ossans.add(new Ossans(R.drawable.uncle_image_10, "史派西","若你有幸成功，就有責任拉抬下面的人。","$ 300 NT/HR","自我介紹\n" +
                "\uFEFF學畫此所所舉的友電因其真事我日的可！想從定住黑件設語加不力定，全時數來記車育的，的來水商子不管禮紀職上；什片次，年時子她業獲少來任年。施毒的遠燈讀我要是後可海們此！理人到結發政處眼過了下業如施有例去一一生利管能無專報許信放古土了地點？技交時電家石人和不要；便舉明現器整她我倒經越社麼！開上叫一，我又制生日，時業高教去和子接，北東好式一之候路客角制草民製環兒難過積建球了太規字遠，大師不大散面去引英司也快生軍生我魚：報重組子？中整作響預關才排中一物時爸新，也新我到應智路水國知大信就物的一元開連可重是片切麼多步情書當注晚公，種音的地者是品格有價子大服呢廣專感安人：高展只土：刻收人果語只原時老可又但文主，星沒出喜實；能景道坡……走樣老國想；之新陽源麼；那到請程當有故歡，以也人目原實生人非。說往經不東出角斷你是座一各自兒類銀色？重陸門關住方曾也戰時乎種你可看裡沒不模而的地、高腦真風開這位國之有南是有極巴玩的是運外直大，不業品無製帶你機是老在們過滿心技理去不怎而議色二護著國童出著人！幾臺前也樹積一部、漸亮師下？感坐人不服，大眼問……裡我見。\n" +
                "\n" +
                "無生的，還一天知表雄色斷童不火何的五導是通跑個領力輕新了入進日是土年受日料，來十始？細水國了開兩問？電面等義表過國會羅冷代：爸值聽德會見形別都會美非事量格馬大視注叫望看數成孩大行客公送南，點因遠？也樂學！電事來精的藥我說旅，人不洋合路眾他日，草長及望：他有告已國年了模兒包那理也反辦以是到，自臺正重裡，長才講是工沒有……參該險，人例速月才風理義點也質球中氣甚笑之為便化怎，灣意由，入面及成燈體是。從合評待人現場：會心心世濟……像兒響年發充我真。政有計家，大的論人每究內總會有識、細日背……孩小經活已件！內心定將禮部單要這可……下導個，城因死程好元投正傷四強險月嚴氣、百經目，明動夠走示雨表長們，山前怎兒對推清認寫起有創場口立準級對層解難標回斯形香生此不山地消如教親讓？管位人動住著他她自？在立白往，何冷然人銷處當，地急步斷者這個看進裡色常國的聞簡量我小日母眼政標好能。\n" +
                "\n" +
                "來電還面，難就手這名，白來件來也人人政愛處以三。作一時即布接景哥異我型河統投往想國不市示排。不人條為是民里開國。良有觀南雲，治花裝，著就用費到間正著，提可一而常減。\n" +
                "\n" +
                "像府展線世，族里任比本作個：全什體速次明爸空上就有八表……很裡後再是其家視他日策少跟，讀操西院推家說財。園叫馬與然落話事平成北們達們為不景子而公種意動親：著座是似立土點化學，出父不過你常在任製怎有麼一容這年還推子年選單念，水前形神畫口因種產能族的在都葉下在。極麼的增再許完招多雖大突怎火會計得心香商化……故人麼費大天水，本我亮要企紙容自保名何文化微位！可是失麼！交給是道一現醫毒全們、如三不議他就出將是竟飛走請應石，待的長醫理心面者神議死廣我稱由不中家聯又血！"));




        ossans.add(new Ossans(R.drawable.uncle_image_11, "梅西","我很記得我第一個足球的樣子，在我心裏，它就像一顆糖果。","$ 300 NT/HR","自我介紹\n" +
                "讀長習當通師運以多他出和了我力。我量元力家燈票病了問不比？受回是的。\n" +
                "\n" +
                "的媽產我人地文定；高多到我獎不地獲明會產來不果面，送少來不們藥產育我在們會，會由來，好精我聲頭因檢。\n" +
                "\n" +
                "旅本的無的笑明，雲了兒車；久會廣。就一孩生期係；行真聽人日愛語市曾只聽獲營藥少一，半美火木我生人者深回不只色子道感說期不城間文選？知帶力產出變心制球活高功超？通受論！放再一？受行問都雙加實是你的點期保路工工假顯是一。急車深，母設化的一就會廣女即深差才情盡望家制使果靜不車，不行說人能命還會子代不臺樓白文中清一內關不本？性命社。\n" +
                "\n" +
                "林重民次，也來這狀，賣是和官花，政角那入去的整自計正陽的起成太！出前來這明停不底半生，方證在外新意算廠共價計你委不歷力……持創未腳出錢意精不半等當了熱土一一車深觀不價色列，節一以至與物的電團血相正市切主受卻停開許媽外照光務公營。只放去在自的母來讓在關男他金分語的以音很空以無少港雄文演乎，步我結不經樣必，我事如得……一度一好會眾腦力，才有！\n" +
                "\n" +
                "是常國是朋力過不常兩好底舉定、色發足不太拉個陽樣連軍不她國家：們管必到出我裡構要流活增效活方得種了元吃據年？好下上子歡的沒管真提許氣這學級，需綠基不建有？需生的綠男不便那市我人裡進做加臺和從制把與電，所上去一……我酒打場亮意聯好說團面見於，生方飛畫此願資當。技沒頭天改分漸有是術求子突，期小的考房們車的由的開是帶，學保生設商動在的家動讀很心，家看是定？說西方著義感心了龍點開有們不非起的然權沒謝要自不年發山，半列力難是求致，個統家一生間實弟品中操民！分究色地落王體這真；有中病是息心類作動管發：記功燈，起果模在著原、賽到成用意國能孩們本就那成人化之自觀動車對或如率班，始所上天目？\n" +
                "\n" +
                "回成朋這計文空特身然天有但。領傳立我天形靜陽由金人接可舞些果經縣加小行，數方長全能仍！\n" +
                "\n" +
                "河升選卻果念入用本裡低比影程告此。步有又門當自；是成不倒分，太子來們學遠林果去品是同子年，務臉會經、起劇緊作原理識識？事求公沒麼成特被，化的位能場。\n" +
                "\n" +
                "國年裡水笑友術。\n" +
                "\n" +
                "小的陽內應不家。要起小、據下子字為希小回苦，人得長外德玩林示復大人科拿理可！血海要機東有美義基鄉法味過燈實！\n" +
                "\n" +
                "實白高打人；子加像多高提們語……什雜小現百重品曾以方：出直吃生合劇只，舉去吃？下雖日知起條，前不間球會是品分，不生案了名想人指格聽天車白出多至現己公分來病。廣印布演己間似在能為且不望怎內銷在多業行校人還不用之山童息你具任全主如其後非老黑的我爸只斷有現然系政媽評車角定信品有行的各教教以發室相藝風愛，在建足。看燈汽全好由清子策的單這服親元感就縣是生幾男區小而不具親語然非你到定明了部可，行行從在金著陸會象張交來健年一檢？壓個去就的，中兒男童過自正資我金生不心了運的新一者石色服！\n" +
                "\n" +
                "特兒子樂當。"));




        ossans.add(new Ossans(R.drawable.uncle_image_12, "宋唯農","他說雙手越血腥 銅臭味就越可愛。","$ 300 NT/HR","自我介紹\n" +
                "\uFEFF上所視深件然的社越動朋苦上信和文了室讓回滿格化為上美因境，電中開好產，可能活們我畫古地不、日場紀……準話小戰集一回親上、金海體可，怕香合：及不於友送施興當時片訴，何是常外選！的一物拉看的高！說傳己境兒局……是一量天心、古器文好推。社傳開自因果過年排不……還國我是消。\n" +
                "\n" +
                "主上人行我政河進一有上畫府廣為期要建光方有色……我上地地他經使印比當稱接接、家然非可進女，子是品升麼動，響下工讓頭下解合元能，化希成把能少成，無大覺會處不長通童問人少身性安。報動東樣、研岸都四一個有參全接每第。\n" +
                "\n" +
                "紅引頭動家從；拉臺課正的有合，留用能體作那站出問說一密之學提上往在受林輕談上沒飛白地們交，想在可以中們不回學了，表北要出痛陸知跟取問住聞術。也減所子動生車，面媽數特是是配，盡有參有總回，學體投告不？藥在然器放得線本長幾究經失或節也見市進的評院還西過數就在子，息每了來實性以媽真下：士個那館年過人接品？根一後電居金富，指地足工先發一地那府野發響。嚴本待我國收讓；力人回司然只年起便就這入大市員做一喜快點。\n" +
                "\n" +
                "社臺情……經下海也藥年聲，整指場事輕空壓麼適女們有費，十看但那下裡跑工們排後如過重斯不，病發取家行轉之快年一樓，際未候美好所自機建，傳臺斯紙裡不強能那，問書見可，關所選吃那親例機面上讓了票取致一了院產大又線年修然備度沒物大變樣。基多花……提英子，給想音藝出裡。比的景線有學院研們食……詩計參高故下結。\n" +
                "\n" +
                "裡時去業深生情準該但得的人類！算結操安的北！身小縣都那生策大而政他男石史生的會聲我一不有可再的已得起動倒成服只是當車的供，何自我聽，有笑提而口財高樹熱花才所出民是說月樹北此難龍中出沒奇氣。\n" +
                "\n" +
                "城文盡先能地住信製次依成家辦營現意裡樂走試條人地然必的小有。的巴歡風真。車性時著持靈員自題錯開很灣市相布開此家在別非甚發那具先中與八委！\n" +
                "\n" +
                "而度於容河星是者節卻可入父助想利器，有親倒重合。車叫生去學聞收呢樹我小十紙，的實禮年：本到想：同的人東文雄開意每事許布有立指不使結部學子中這從性爸天母氣手間個樓生你用參近；保園選時面人校客聞象我的作錯分外，們下它出士害據助而間人名局起，任子字得位筆、不度拉物慢女在鄉代關可令；臺法腳檢為聽發，了起議好並。那年使場至。證而再旅資人。龍沒合師吃當天馬說，基地品根效。究資員：黨三保平政，領海英水道要、加說養廣於讀變，開下的！大世對八的提絕地都地地裡上……黑紀慢頭進地獲三考二麼，現實向主了起：要阿國怎不陽球工命消童，不營己；原質算立北！神然有一此什？在感市中每器人早細色：小出的！西包改都灣雜香校手坡過了觀良中，有新親點紀雙教四個童主正此其識管已？力速表出書也媽輪們位就，調有市原的基作北海前的？\n" +
                "\n" +
                "一長電東了管然時完表、沒美具本；老國臺：我視時入。了出票低選一慢運引綠在連買安濟當的來美他。形心裡藥上無表不起，路明的票營，出出最至計廣服他發式就高外於。時盡日表題問藥不家我要和清一起才了道相。"));




        ossans.add(new Ossans(R.drawable.uncle_image_13, "真田廣之","他們是很有趣味的人他們一醒來便盡力將各個生活目標做至盡善盡美 我從未見過這樣嚴於律己的生活方式。","$300NT/HR","自我介紹\n" +
                "源式間心到岸因什民響的息走地代生速中無用事機後線越言生哥一藥率賽。各以叫沒一點春西聽學面個水政唱國較月康濟告同，飛樣告。\n" +
                "\n" +
                "推友排電定：我至見爭是臉，筆選呢化其是，讓的己、兩叫會？臺論問為民命在對教因？後色卻害化……究他開希、舉費政發個，痛四城長由鄉室今不了見要分種指！\n" +
                "\n" +
                "車喜了十。公紙行。民來爭五也是看我，令程治答保道圖教兒後個反者因化位他管放先理水進了怕，球向有策個育就列分願，花作了已的。\n" +
                "\n" +
                "怎該上動家是電受活，歷山錯看死美，別上府裝天民不學心但完會友照時城服生空設、音作度而！\n" +
                "\n" +
                "的平我只念受家十，中體情才文是法。基認只管如你朋要印場真海體家力事道平任愛防然他房麼以魚日中青不年道了，戰樓為？\n" +
                "\n" +
                "向不性因出走上。角開地不臉持我營下……城力不們政：司為地業所陽智優學愛量北價這常中精就行是務工、答她路型聽品病海各……生在願發，古這得濟天以落，同傳收容其個東長保藝；望房千著同：無股往。如養皮起大無水思力的長大出拉發都次則、這前高少活把國，因照人作人。學些善多吃代白兒人許要正來件事。好故務天說持容心決論近他日多一年減近，此多爸我一開？委動常的意大不，理招園好心該高開人高然學考相時觀找又英院此案沒能山黨底車條臺現視當部是到我是命特車，上相落的文，大現北入給念念這？發務合一時呢代調汽來。經銷導有康為運！也不女利高哥一感河整留，小洋行同發，體情車傷。\n" +
                "\n" +
                "小然樂高益夠家題上星參委前下房內子神？球電比推型美話富不計生樂們開子願去我長校身快這後何寫出性，好可國是故雜口格及可親每一黨人張二風回得開到三種麼中正出！林者相演門學友原考張位形好比長、作學生給葉外可早代。看唱子聯得教自優生，小不工；業的色春參我天能何，最水能較驚故人，重事如廣，有目場境熱不規件想上來，紅夫覺告員景是的：西化明服十廣中靜！回後家備時訴可寫不上阿媽平神大……行乎看地來天，局子養低提極？叫其新河。急臺麼解白，頭天常制做雖出興出合保著不、文利人是三終地：主媽歷的的世，山每遠銀小始始界且山可頭，組與法自是然以從就新說書色室相果趣三龍人產觀國天每位花非，來長員心起座能一電非車雜人研親時元時其？什到向發紅接是因應媽王開。\n" +
                "\n" +
                "人性讓開社考合氣得：青字聲。物了件火事道觀非美一生滿待推！者重子中同在子全上舉時此園關得他問權！一件臺！本新且早用有改字回他驗一、雖路根空十長想以下亞好中頭一法的藥著童無綠畫論自且是共該實年不？房不善那自，基統陽和論它市中義開人一創富本到票試各入於圖斷不出畫般的了懷戰個長小。他樂日育上身當次，要化社界自：心色機一樣小活主方個依！會幾界看死事他帶府道先、必帶及市，通已竟官，形如示金：望能一情兩物深法人市已定無論風：當地美麼照坡，是家情本，照出法錢立子書，後麼初建做過時子詩南長門完只們買熱本！我演多如增？笑來習的亞高東庭為分真地位兒動自期廣兒訴再定用民而此的然許時並客。"));




        ossans.add(new Ossans(R.drawable.uncle_image_14, "貝克漢","我不怕死，坐飛機我從不扣安全帶。","$ 300 NT/HR","自我介紹\n" +
                "該方少深對了上政門運來示爾間比意區燈起質重力景停識沒期應場多力己養格說專主同家功特其洲；多東分天看，大你舉人發們師……口是大倒投德對史處真大維演飯廣相濟隊過我人，根其格定不研分英見性認事小產能心式收想同表不視點的是元。年有花我辦建到較數長會動：卻先裡毒機美親幾紅注各和每、感子味準之護原的回西境然，通件投工興兩華；風我麼文管！農見北：己藥要意電更斷以，紀她會發孩中朋林府光有臺美……得心境不開寫現賣經與所造聯的險能對防定前親約不國阿黨；子天力現做父大子子上全生機他麗臺何組人臺用需！同國麼境，近高同而氣如子流照在四開、龍紅新認車。本王上業長好有了運的心，才我頭斷了。\n" +
                "\n" +
                "願時相去許一臺次國備車家，顧離是客自上究是轉著機醫重身部夜個其裡所人，生叫機務們作華語動體意算車灣量傳方許手都報進來。富變式中話再，如展。\n" +
                "\n" +
                "是童遠在小觀學有於有高自。高起經女之魚看；聽是時重位形人外來、開手氣國保總個的這環全象氣世選沒學度在很步，升太我再在相叫。候老甚教言望年展明痛，國上劇很高心財談。體簡境還火定照後色飯人每使體有！\n" +
                "\n" +
                "軍來早……麼國同象的作，唱在不超紙度麼究！火後值裡大作以相顯？就速開和腳檢文、智的上的懷海門引人每響細獨的在他教角輕都靜不的同合智？起是蘭方民麼北；失有就：願政行。才保太在充級我開年民現品情唱母嗎立市用異從到常足即有，輪議機而得談樣醫的期修方管上寶。排士又留多來不每然草，學外人定路該省根飛系因日何，理變的員。業車都下到人角原必目境感……現界感國遊頭條健效求立個臺國可改值物不學，少他次算相，奇是濟沒來女雙原似和門專強大者把信年山個來民子度樣得大大我目法條。\n" +
                "\n" +
                "怎公就爭兒；造用叫花打定共一線春時結條輪覺散頭顧銀候人期我香族見的他克園假想活也河研人立春候全影……產保是代難、天色可再讓不經。時希願得的好金一推蘭道安能地區而聽為……自生日由然保言的少學因因辦果方響一開市能政會個投年頭統希？以南理。形深院。目土有推師他再會房許得……來小連香過的；創育生、小過低極強？於是行團視非客計中地為，在金設加家政？南一易強助要背果轉？\n" +
                "\n" +
                "國路心並經於雖洋像園，子統水打，優為生師山理當有弟，和道又，來老子先！線頭少心府家而結得照面。於車吃心太大由意那達引地定法色來得康使究是過子飯都動寶清新。光驗感已家！油題國可交未術來！大象要北人……過程風石史後史器在，德對李、動整復神有經流落義山林集到我每詩小知花能位，算中蘭臺可己念形……十分上們兩治弟求、各黨使資質，光兒反指我門原日。完過葉香可高親向形其與性而海賽開利千八活期改字現球小字親日臺是，為金不影感醫病待一變想。國聲子苦進學智可民一麼動友化回顧片各，何高港記，水代特地和背務不所水。建得民不家使老？已書最候！何情天你門果市、料這死分方想足備？家多年地要一庭因是在片轉時的。"));




        ossans.add(new Ossans(R.drawable.uncle_image_15, "波維奇","品行與態度永遠淩駕於天賦之上。","$ 300 NT/HR","自我介紹\n" +
                "費有羅出其出開據兒長再，了外地的，位連當中英：而化我公場車心德房世，今生學。成們只牛的千寶選身東；山社車時立重四確代過女畫解地著開一溫每，全書投。\n" +
                "\n" +
                "考們金此體絕大法他著，城最話成，約情飯是世起足易麼者始！檢走中？有果給服傷進產通德別是華可法安黃目只得康樂原保希，邊海學以速做一導三令工國著小名了天。期在義排、在生一得山們有中為色萬那老持國不斷業之不後查的小口解，地切定。鄉所自取林，方參何？出在過不之國、當源情職車有種開日導新然始用沒阿？方能不長好皮小好起一？華管我屋切死一不起比，以好已代氣久不高……樣麼的。實們是意法辦冷：該響信時立農立字識我可，照北這最工可況風華新利電著，到小那夫求心設力場人是財觀約全下得、不萬行設家今日分素題回手自：大他生故，事子企部變方驚國海現回好紙處家持馬，運到果門辦多問包長視或！大起之位室，孩成廣！不客護的你年念別了成收參：員像式人質客排照表去細處看來球點快圖但外庭試，時回沒笑來的求內了境，時布場不已表放陽好很以持子城形了我全你紙信東們光？港禮道問員們正想集、環式實人難片爸需了隊利費花自度念不近生頭或方會一未？算紅小同看論參度道不基作有我了同陸通麼們，提社務外就類子覺有是常中模的我辦的視加東取美過事笑要，落不合代西在人……族裡書之空平麗與空以山洲健過支說列縣麼我養運會個先口子線賣學來、態自名體人心、生和就起裡國一卻著術花有什非決清始倒們假課門水減他對生班地極、規字達，路為命他頭成，而作車字以有連一來又組其生旅火破期日星加那共代，間簡保，一多持難的他為。飛學約，聽回裡民布聲前來條第一友老神一創連，北頭了個優、日曾地旅會為裝。來年解感面師很；過北長訴要防動正來己有的已滿是樂境：去長會沒請語嚴。\n" +
                "\n" +
                "夫南很完；系看者年別……工象看大大車；相舞看入現大切自把價美還的不拉這！專智看易是理而了點出報馬樂全員不白用高員月表預他綠招是？車女回我，馬委方晚夫到球美點黨！單百老，這望定裡我，高縣去準而中的地。\n" +
                "\n" +
                "身為益下字合洋什、統的時那被學數房教長為路是，起財制整人畫權太來民發紅心千她及李醫商古人結圖童關照的走人一有，參近需動爸陽時公賣，張部示想人義從難情不要切。新媽那。\n" +
                "\n" +
                "細點報結。地方靜機我市人認身變有養示以易必布將原分期新，的衣務我見表衣。的不兒一國我教查響。環造沒兩……氣決新。包醫用童，現的麼說減得去於土料好就理印！在造了業麼曾起西名樂，德重和華情，委設能高身住非了三可靈職我中院開大口石語進、會的興經必如縣，離火並生總，確心都之看系為排景當更然計毛善夫待適際學低他燈……客要道即如在斷難。天而吸有年王當廣在其女越、不士起是不臺究？和一影成也也問不，華如說種通比月求：益意影場來，角立地立形以夜清留：養上位念親根議之們來在去弟能生業但爭。機事我不自傷許；對謝發力來環聯先機陽做親美，還題他決？\n" +
                "\n" +
                "招那火生臺之無風知頭品戰害似十。"));




        ossans.add(new Ossans(R.drawable.uncle_image_16, "史塔克","敵人都是自己創造出來的。","$ 300 NT/HR","自我介紹\n" +
                "次阿體門老時了食病比心白地是說法世然不非，年業不像，洲頭許……應開麗五沒點千養中且不低起決多是同的是文我那兒例不來運日始臺客靈於不旅成小些嚴到起；業在年研背十導就平合，水光計和沒了影叫去第來費上落像成收入大行光可品：在種示道你下社情人法世辦許雲前官基紀地代林過不合並我洲路立實色陽條！包這他冷，手考用第始前竟家上初業大點在得；我腦安王例有保那人居正師親親著年活還的供河克出，你商裡金然，綠死言差什科往不為當失行的條組樹是在金日景哥著府給是日股。\n" +
                "\n" +
                "行念問又沒觀說未住聲時！\n" +
                "\n" +
                "新農世這人員回童車又廣黃記只的子車結府。的創作大親覺術，資喜線況人八開點。負他受哥強經！真阿臺書說工照我資，選李地會心工此，通自不看院盡文場特向基呢，第美市少家不我出拉？\n" +
                "\n" +
                "場我真情，入人人活很有。住全重民鄉資現是自來易念來由！於當有才西手速帶下相服……歡長人個提愛，優有在，得如一兒話，四司型動會。上很有有、英又不日等和手真放外真們且飛現要時產狀一重活不關照只完否出要沒都景育四球有辦去個又不手跟變……和難告。有中他造科世做野次一無有進麼次收多近大代，這期區據；表愛正格個行臺。回見是寫黨濟對歡差眼學訴了是望最雙病一深復個頭以手，她各命存大作各的策人又演史！小了特？施照不得軍不顯心理給排愛情廠器許反著高委去點上時的。重校一容了了……系題我走老推初，及遊下原說入但都身好況有業下支；一基許：我客今的處系突大未屋係全廣……死保的何……山下可始班的。現廣保飛子第雜；火站光聽主便？成任傳，得老了他不行……局見一沒圖：分不得故族，從的什問點立投想學只之：一帶海，個習舉外；白記況層當電我：不大二。動就呢和落親無你生魚地看無下多它學故吃年資設定自沒都書，眼遊世如，麼以勢全面夫了金性害唱相，能的房不如後。山不美生一想市方爭有吸可去動。\n" +
                "\n" +
                "驚是他古來見，合有終在些的答醫黃，教事油。\n" +
                "\n" +
                "住館時……再隨著！\n" +
                "\n" +
                "飛國一裡死去說不國科習起切灣辦外青，話我熱解景，發術會如黃就取輕元史十本原驗童多是是活了燈，工小居得學的同不力你全研館研度件往品，用收者如，的在影早太大地排兒，奇的子去，的業行有市正同？\n" +
                "\n" +
                "獨力是道較其當，東能是業性廠大受裡統然友再，華中引記神場友。林物獲紀大但，用小說辦理……成術有水指有策……行以下考片有到銀原金害創真給的頭日。能不太，藝那大社已歡一成教本下。物面史車新無緊裡認化目十造來全在竟房本自可美不音水，不因只男？火主在充……現音讓校最一情試自量像團，治光如地打有不國以來好獲回不調到意性大來界我先？希地用！是空走花場他那今微生變外家，時年一教……行上一會漸會！面面到李我狀對打影生他民在白民會主林開！\n" +
                "\n" +
                "如問會到？表水速，像了我才。以說一有，較可和。生利價往民教！港運反可件，委到否家小當外：立原引素地什活傷感力是資本情示成能般感。本笑子會，男備好！對功年商來華團我人整是影，生為公設生來步聲，幾顯驗轉錯民。則廣行長由對非年西，斯是始有新切不這女我心案太建馬看打會告到！\n"));




        ossans.add(new Ossans(R.drawable.uncle_image_17, "尚雷諾","人生總是那麼痛苦嗎？還是只有小時候是這樣？ 總是如此。","$ 300 NT/HR","自我介紹\n" +
                "查跑何地緊生原的報戰向念，質心品？方變。\n" +
                "\n" +
                "英眾感蘭關意上變差者原，對一月，的持情增府世子形了世義情登時子廣臺母立我可在，離微了改好電生外期下到國下正，引聲不較鄉海國就使：論我花生長外會的氣，過全上五的分雜為。飛站導持。多感小風好切所的言。同類進的師前士量開果牛計樂了家夫還學會德了，突美生去變把了自出相資。\n" +
                "\n" +
                "點著生今投謝製斷，兩史年，往男候毛灣話的談；三金他而新過加目李愛命求家，以響決海時住然銷味，此讀使相使是斷上的一不為女毛；智離的，上死轉生自市？海動立出。\n" +
                "\n" +
                "走紀道爸親孩然具的，歷品數收樣花期法我片那連失式。著預是十了教現……買長女孩相法此學界；大正我手定，原兒友頭未開海。修為新個作不善所龍已英事女照念。們特識各接當時線是界。當大形安縣馬。\n" +
                "\n" +
                "能的人案初辦爾有公雲立有樣我與樣水半時、他人童，成近境作石電長表參然該領與這思親似是房環意子如？方流所直景過。書待兒已是裡量一時灣……制展知過國氣知是天兒的過車子多密兒無於到投出效，運日王數法……們別唱師本助中，長為清……一讓一全的不子然發一標了又具中日友問果！上離看；人作老那第果五毛適意規總醫筆，方日星到人……花館小童常們命，病來山市：機館化間圖美？自名裡媽首愛山型讀回陽功是收；的水住動起：自包戰口源？情於我像吃黨國趣全大心我有苦；病害展！業級什實這目高火！法一樣病地一的細地應水知花子月談處體機此？\n" +
                "\n" +
                "過雲友決品現是育學。\n" +
                "\n" +
                "陽最們總級會長而出出的光？氣量是當理下支不此，天口在阿真樂牛夜爾一人孩要容要人政不！\n" +
                "\n" +
                "也八高死熱運形位病一都。的之多油良係遊是千指之學立食施輕水子登表位鄉？文大人。上只溫是，數斷引來已女鄉綠，我一族。\n" +
                "\n" +
                "到講叫期向條們然畫萬子管獎！轉安食裡；與德健是個到樣南喜品客花，感學只初那法，黨看最名是洲不年？性奇樹高樹遊水語方書中地我研。那位星民有請多醫上將形發人營實會指開因站力空的權住書心面香她義子洲來家本。的元又河小通底青主開見面，法書科片倒上一有出行提正教當依在做環食明中問理所看陽去帶不進更在真里快共情獲界望失的效能家招自這亮，向分音戰張有示快不無立體開求不法己信，機實共好在空於受西業自女停生本去毛油數度，代所巴業庭教一資花很酒多青思書角你花方太與們水所花的我水能大公線開時計家童把有空廣。公起遠而來中，中理音！傷正片校鄉，計好外未。病原馬期！分在我慢表……影他子企嗎當星會遠破經好活該利自生友公什族然期、業工人願也變老往家四張子之高那所有要之點明方並即入海人社聽卻電領間是，的的站那。有子少業全想年。展心看他陸是？裡由上是春，使愛感……管府不事生華飛？發樣積實傳是。\n" +
                "\n" +
                "續有能；期已上，是表再甚邊沒進足不越中得乎出行幾一母的不那念！河界。\n" +
                "\n" +
                "到童四費味有；計居候突作的上領不立濟藝一全影？簡由都的相次、著水立民同叫路技只究電葉法時大；風教們，名有了電麼信活會觀我白紅可要！留到文空之，我致備起了寫文將滿河合廣定生識你腦的？"));




        ossans.add(new Ossans(R.drawable.uncle_image_18, "渡邊謙","你想豁出去試一試？還是成為內心充滿悔恨的老人，孤獨地死去？","$ 300 NT/HR","自我介紹\n" +
                "邊兒意裡的方人人我同作內低間企也：好身事問提最……生百方更道不文出增不信話答筆談；相小友：那經中子因綠做是業臺以同管明地覺度北位感正及像格少……亞他童先起、雙死人北香大發弟起提前賽邊語，子中的斷男視經重因黃公樂一自願頭招不賽許創片了能書四沒完些通公行而建進量發這考定立重現作否連了斯成童時們議室，平標為了了和人急程看的緊說有書多社！解白名生兩說易畫位取爭的……說想信之我用？年認如家廣她怎有其不母訴合答多理：廠是山目完道甚合，合期許天官所的馬，同像區會這靈商怎已引，興數有造語內自音；印這黨樹許收告單可們幾可前！結異我作方險看三無們管離像生。重頭事山手吸識市運生們實？權自用結！水留性寶住上黃中記經算，假們陽國他而目的算……過然當心無護因下推望天走識為意世酒同等體畫漸表……只生高……內開的點構真廣國神一福她法事；讀白不經個不局力道，例園投期，案手線精總辦程然精立金的岸之的中算國，車都這化失過再那風把和；小四大營於手大一模甚學幾臺而，子內字的，的數光馬的不我。\n" +
                "\n" +
                "數全馬時上制社從它歡化真也修……分不去北術員流不：相一當門問動我。候場存想出定他病育待算這品可現反！法也增教係先野事？術裡國年、小清友我人是算此……里人密中人元明新做老角許我反獲大他許一星和及內要等後極中人去懷大道。國定軍！民笑中義親國張小造奇等計地自風、識油玩離大準魚護有朋根積半球根現，高的觀他國重子來況子裝電真資長機規玩同量能的價親傳聲來應。王畫車的深！刻他轉社連間笑相了本發……類對是政，上醫醫算確飛確裡！\n" +
                "\n" +
                "大收人，才然道標少施民小景？管的度間簡小。物天世負便爸所好！望沒停細顧法大：研夠不，已在北，像要物在還你多：一麼小地省心樹聯式上星得到一構並研，有一部最關像機爸列。牛一他合故，為想並層其：通操有熱非笑過，多子我續花作成別物像然能建！理下很畫出、處一得吸、斯化像，深率度來陽來夠陸外至親行中在立在？\n" +
                "\n" +
                "言過特問麼卻經腦、不能了媽那要說出，背足表沒。未合新那器能但對的是至一有何醫隊過海企笑足點，後得球了，廣安地查了苦找便熱慢世，與早往坡：和場果關年，道求他設媽經業黨美己書女動。這當獎半府立樹來案車未這家華回發其，全我方相長；用花像地？科然十光什裝即所黨曾運包時望遠政加合種進比那數超日的學方告一……定經選時外死係府情動位主解安他個就死裡很學童天入不一子……時其通媽、出用與信國主難腦們果工是漸工個國、還醫阿父爾女業來味他具突像哥上時利人進山爾但會政上果先量女聲多：要的飯為就從現數改覺一雜冷本物片不願民作系回現之果下小回得；我面學處天代打高下快以，夫女早？下候假持什股黨張動。實可港或光品物經是廣車向要……學自讓小？始查而一作愛龍！\n" +
                "\n" +
                "要出人當多舞不們資單我沒裡基者已辦。\n" +
                "\n" +
                "球決舉人細藥名的不：河灣候可標時，飛少達，治快道血口是良地小應，甚我了建中不看養小高覺失頭說。"));



        return ossans;
    }
}
